#### NumberingSchemaTypes.StructuralNumberingSchemas Members

---

|  |
| --- |
| NumberingSchemaTypes StructuralNumberingSchemas Class   Properties   See Also |

Provides a container of all Revit built-in NumberingSchemaType instances.

The  NumberingSchemaTypes StructuralNumberingSchemas  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | Rebar | Built-in schema used for numbering rebar elements |
| Public property Static member | RebarCoupler | Built-in schema used for numbering rebar coupler elements |
| Public property Static member | ReinforcementFabric | Built-in schema used for numbering fabric reinforcement elements |

# See Also

NumberingSchemaTypes StructuralNumberingSchemas Class

Autodesk.Revit.DB Namespace